{
  "events": [
    {
      "id": "-6",
      "name": "TechBash 2025",
      "eventStartDate": "2025-11-04T00:00:00Z",
      "eventEndDate": "2025-11-07T00:00:00Z",
      "location": "Kalahari Resorts, Pocono Manor, Pennsylvania, United States",
      "website": "https://techbash.com/"
    },
    {
      "id": "-5",
      "name": "Momentum 2025",
      "eventStartDate": "2025-10-16T00:00:00Z",
      "eventEndDate": "2025-10-16T00:00:00Z",
      "location": "Cincinnati, Ohio, United States",
      "website": "https://momentumdevcon.com"  
    },
    {
      "id": -4,
      "name": "QA or the Highway",
      "eventStartDate": "2025-06-27T00:00:00Z",
      "eventEndDate": "2025-06-27T00:00:00Z",
      "location": "Columbus, Ohio, United States",
      "website": "https://www.qaorthehwy.com/"
    },
    {
      "id": -3,
      "name": "CodeMash 2025",
      "eventStartDate": "2025-01-14T00:00:00Z",
      "eventEndDate": "2025-01-17T00:00:00Z",
      "location": "Sandusky, Ohio, United States",
      "website": "https://codemash.org/"
    },
    {
      "id": 16569,
      "name": "The Commit Your Code Conference",
      "eventStartDate": "2024-12-05T00:00:00",
      "eventEndDate": "2024-12-06T00:00:00",
      "location": "Dallas, Texas, United States",
      "website": null
    }
  ],
  "sessions": [
    {
      "id": -1,
      "title": "Back To The Future",
      "description": "Become a proponent of the KISS method.\n\nBefore the proliferation of JavaScript frameworks and other tooling, sites were planned and organized around the concept of pages built and served by the back-end. We also optimized these sites to account for the low bandwidth and slow computers available at the time.\n\nHave you ever noticed how frequently old things become new again: remakes of music, movies, and bell bottom pants (for starters)?\n\nWeb design is coming full circle: In this talk, we will examine some of these older design patterns. We'll take a look at why we used them and how they are becoming relevant again today. We will examine the impact of tooling on JavaScript performance as well as what this means when developing a Progressive Web Application.",
      "sessionUrl": null,
      "languageCode": "en",
      "language": "English"
    },
    {
      "id": -2,
      "title": "A Lifecycle Of Code Under Test",
      "description": "When thinking about tests against code, have you \"done enough?\" How do you know that the code is covered appropriately, that odd bugs aren't going to crop up? Did you cover all the use cases and what if someone changes the code down-the-road?\n\nThis session is about the unit and integration tests that a developer writes to test their code immediately, not about higher level tests that are written by a QA individual or department.\n\nThis session will examine the code and tests holistically against the various lifecycle stages of code and how the testing needs to adjust:\n\n* Define Inputs and Outputs\n* Write Initial Test Coverage\n* Handling Bug Coverage\n* Refactoring\n* Abstraction\n* Future Work (how are tests affected?)",
      "sessionUrl": null,
      "languageCode": "en",
      "language": "English"
    },
    {
      "id": -3,
      "title": "TypeScript Features You Can Use Immediately",
      "description": "Whether it's demystifying function overloading or breaking referential transparency, we'll discuss many obscure and useful features in TypeScript.",
      "sessionUrl": null,
      "languageCode": "en",
      "language": "English"
    },
    {
      "id": -4,
      "title": "Crafting Testable JavaScript",
      "description": "How confident can we be that untested code is free of bugs? Tested code increases confidence that a project is free of bugs.\n\nGood unit tests ... test only one method. Good unit tests should not rely on other methods being called or used and should have only a single assertion.\n\nGood integration tests ... verify that the parts can work together. Good integration tests strike a great balance on the trade-off between confidence and speed/expense.\n\n* Less than 50% code coverage on a project is a red flag.\n* Between 60% and 80% code coverage is the sweet spot.\n* Anything over 80% is gravy.\n\nWhat is testable code? What is a good unit test? Is there code we can watch for that can indicate potential issues that will make testing difficult? These questions and more will be covered in this presentation.",
      "sessionUrl": null,
      "languageCode": "en",
      "language": "English"
    },
    {
      "id": -5,
      "title": "Offline First with Progressive Web Applications",
      "description": "",
      "sessionUrl": null,
      "languageCode": "en",
      "language": "English"
    }
  ]
}